# SchemaName Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCFileModelOptions..::..SchemaName Property
IFCFileModelOptions Class See Also
---
The name of the schema.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public string SchemaName { get; set; }
```

Visual Basic
---
```text
Public Property SchemaName As String
	Get
	Set
```

Visual C++
---
```text
public:
property String^ SchemaName {
	String^ get ();
	void set (String^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
IFCFileModelOptions Class
Autodesk.Revit.DB.IFC Namespace